a = int(input("Введите A сторону коробки: "))
b = int(input("Введите B сторону коробки: "))
c = int(input("Введите С сторону коробки: "))
k = int(input("Введите высоту двери: "))
m = int(input("Введите ширину двери: "))

no_pass = 1

if a <= k and b <= m:
    print("Пройдет при высоте коробки A(", a, "), ширине B(", b, ") и длинне С(", c, ")")
    no_pass = 0
if a <= k and c <= m:
    print("Пройдет при высоте коробки A(", a, "), ширине C(", c, ") и длинне B(", b, ")")
    no_pass = 0
if b <= k and a <= m:
    print("Пройдет при высоте коробки B(", b, "), ширине A(", a, ") и длинне С(", c, ")")
    no_pass = 0
if b <= k and c <= m:
    print("Пройдет при высоте коробки B(", b, "), ширине C(", c, ") и длинне A(", a, ")")
    no_pass = 0
if c <= k and a <= m:
    print("Пройдет при высоте коробки C(", c, "), ширине A(", a, ") и длинне B(", b, ")")
    no_pass = 0
if c <= k and b <= m:
    print("Пройдет при высоте коробки C(", c, "), ширине B(", b, ") и длинне A(", a, ")")
    no_pass = 0

if no_pass == 1:
    print("Не пройдет")
